<?php

namespace App\Traits\Salaires;

trait SalairesTrait
{

    public function header()
    {
      return  $columnMapping = [
              'التسلسل',
              'الرقم الوظيفي',
              'الإسم',
              'الراتب الأساسي',
              'بدل السكن',
              'بدل الموصلات',
              'الوقت الإضافي',
              'الحوافز',
              'العمولات',
              'المجموع الإجمالي',
              'الغيابات',
              'تأخير',
              'قروض او سلف',
              'مجموع الحسوم',
              'صافي الراتب',
              'الحالة'

        ];
        
    }


}