<?php

namespace App\Traits\Vacation;

trait VacationTrait
{

    public function header()
    {
      return  $columnMapping = [
            'weekday' => ' الأسبوع',
            'work_start' => 'وقت البداية',
            'work_end' => 'وقت النهاية',
        ];
        
    }
    public function body()
    {
       return $columnMap = [
            'weekday',
            'work_start',
            'work_end',

        ];
    }
    public function Vacation_type()
    {
        return $options = [
            "أجازة عادية للسعوديين",
            "الإجازة العادية - غياب بعذر",
            "إجازة الوفاة",
            "أجازة إضطرارية للسعوديين",
            "الإجازة المرضية",
            "إجازة مرافقة مريض",
            "الإجازة الإستثنائية",
            "إجازة إستثنائية للمرافقة",
            "إجازة الامتحان الدراسي",
            "إجازة الأبوة",
            "إجازة تعويض تأخير",
            "إجازة وقوع كارثة",
            "إجازة ثقافية داخلية",
            "إجازة ثقافية خارجية",
            "المشاركة في أعمال الإغاثة",
            "إجازة غسيل فشل كلوي",
            "إجازة رياضية داخلية",
            "إجازة رياضية خارجية",
            "إجازة مرضية بسبب مرض خطير"
        ];
        

    }



}